Show / Hide Table of Contents
Class WeldParam
Parameter which represts the record of the weld in IDEA MPRL
Inheritance
System.Object
MprlRecord
WeldParam
Inherited Members
 MprlRecord.Name
 MprlRecord.TableId
 MprlRecord.ItemId
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Parameters
Assembly: IdeaRS.OpenModel.dll
Syntax
[DataContract]
[Serializable]
public class WeldParam : MprlRecord
Properties
Improve this Doc   View Source
Size
Gets or sets the size of the weld
Declaration
[DataMember]
public double Size { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
WeldType
Gets or sets the type of the weld
Declaration
[DataMember]
public WeldType WeldType { get; set; }
Property Value
 Type |  Description
 WeldType
 Improve this Doc
 View Source